# for loop:

# for loop-ში მოცემულია კონკრეტული იტერაციების რაოდენობა.
# განსხვავების შემთხვევაში, for loop გამოიყენება ისევე როგორც რიცხვების სიაში გადასათარგმნაში, სიაში გადატარებაში, 
#რიცხვების თანახმად რაოდენობის ჩამოწერაში და სხვ.
# while loop:

# while loop-ის გამოყენების მთავარი შერჩეული სიტუაციები არიან, სადაც დაიცვამება შემთხვევების სიდიდის გარკვეული მდგომარეობის დროს.
# იტერაციის შემთხვევაში, while loop განსხვავების შესაძლებლობა არის არასრულწლოვანი, და ის გამოიყენება როგორც პროცესი,
# რომელიც განმარტების დროს შეწყდება.