#for loop-ს გამოიყენება მრავალჯერად, როდესაც გვჭირდება:

#დასაწყისში გვჭირდება მოცემული კოდის ბლოკის გაშვება მრავალჯერად.
#მოცემული კოდის ბლოკის გაშვება რამდენჯერაც გვინდა, დასრულების შემდეგ.
#ელემენტების კოლექციაში (start, end, interacion) გვაქვს და გვჭირდება ყოველი ელემენტისთვის მაქსიმუმ ეფექტური მეხსიერების განსაზღვრა.
#როდესაც გვინდა რეპეტიცია კონკრეტული ინტერვალით ან კონკრეტულ ინდექსებში.
#აქვე მაქვს მაგალითები:

#ლისტის ყველა ელემენტზე გადასვლა:
my_list = [1, 2, 3, 4, 5]
for item in my_list:
    print(item)
#ინდექსების გამოყენება სიაში:
my_list = [1, 2, 3, 4, 5]
for i in range(len(my_list)):
    print(my_list[i])
# რეპეტიცია კონკრეტულ ინტერვალში:
for i in range(5):
    print("Hello, world!")
# ამ მაგალითებში, for loop გვაძლევს მრავალჯერად გამოტანას კონკრეტული იტერაციების მიხედვით, დასრულების შემდეგ.



