#if: ეს ინსტრუქცია გვთავაზობს შესაბამის მოქმედებას, როდესაც პირობის პირისპექტივით შესაბამის შედეგი გვაქვს მიხედვით.

#elif: შეიძლება გამოიყენება გადაკვეთის მეორე შესაბამისი შედეგის დათვლისას. თუ if პირობა არ გამოიცა, წარმოადგენს შესაბამის შედეგებს.

#else: ეს ინსტრუქცია გვთავაზობს შესაბამის მოქმედებას, როდესაც არცერთი if ან elif პირობა არ გამოიცა.

#ქვემოთ მაქვს მაგალითები:

num = 10

if num > 10:
    print("num is greater than 10")
elif num == 10:
    print("num is equal to 10")
else:
    print("num is less than 10")
#ამ მაგალითში, თუ num მეტია 10-ზე, პირობა გასცდება და დაბეჭდება "um is greater than 10". თუ num ტოლია 10-ს, პირობა გასცდება 
#elif ის მიხედვით და დაბეჭდება "num is equal to 10". თუ არც ერთი პირობა არ არის სრულდება, იგივეა "num is less than 10" გამოსცდება.